src/Catalogs/ШаблоныСообщений/ШаблоныСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3bf9e05f-3d68-4087-880c-d7121ba61651">
  <name>ШаблоныСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>табАид_ПредназначенДляГолосовогоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5814cb3a-8f7c-45b4-a590-b69d4912120f">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="589e73a1-f4a9-44c0-b103-b04b9442acbf">
    <name>ПредназначенДляSMS</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="abc5a5fb-237f-4335-b03d-881cbb8c39ba">
    <name>ПредназначенДляВводаНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd60e4b1-4d7c-4169-8359-8367163abb99">
    <name>ПредназначенДляЭлектронныхПисем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8368e1fa-da0c-4a9b-9d50-a122933c7899">
    <name>ВладелецШаблона</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>табАид_Прощание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="4024d8b7-07d8-4d0b-91d5-01703dd89c6f">
    <name>ВнешняяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c3f19f1-acfa-43f3-8b1a-dd4c07be685b">
    <name>ТемаПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9c504315-376b-4d27-bb23-11309e1c7470">
    <name>ОтправлятьВТранслите</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f86f24d2-9a83-47ae-9d95-b49a0a295770">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="293c7699-06c9-4857-a7d5-1d0e7acc7fb5">
    <name>ПолноеИмяТипаПараметраВводаНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a7f32a7-5320-48de-ab68-9e8bb8de1b71">
    <name>УпаковатьВАрхив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2f26970e-b964-43e2-8d6d-999bbc577689">
    <name>ТранслитерироватьИменаФайлов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c17a594-eb0b-4cdf-af35-0eaba968e065">
    <name>ПодписьИПечать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e489f89-3371-4e57-8e2b-360f08db1a46">
    <name>ТекстШаблонаSMS</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="17477f72-0622-445c-9cb7-2c5a5a65bbe0">
    <name>Параметры</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/Enums/табАид_ТипыСообщений/табАид_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>табАид_ТипыСообщений</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>ГолосовоеСообщение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ШаблоныСообщений/Forms/табАид_ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипСообщения", ЭтотОбъект.ТипСообщенияОтбор) тогда
		Если ЭтотОбъект.ТипСообщенияОтбор = Перечисления.табАид_ТипыСообщений.Email тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"ПредназначенДляЭлектронныхПисем",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.табАид_ТипыСообщений.SMS тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"ПредназначенДляSMS",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.табАид_ТипыСообщений.ГолосовоеСообщение тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"табАид_ПредназначенДляГолосовогоСообщения",Истина,,,Истина);
		иначе
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляЭлектронныхПисем");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляSMS");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "табАид_ПредназначенДляГолосовогоСообщения");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,"Назначение","ТАБ АИД",,,Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьШаблон(Команда)
	ВидСообщения = "";
	Если ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.ГолосовоеСообщение") Тогда
		ВидСообщения = "ГолосовоеСообщение";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.SMS") Тогда
		ВидСообщения = "СообщениеSMS";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.Email") Тогда
		ВидСообщения = "Почта";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения", ВидСообщения);
	ПараметрыФормы.Вставить("ЭтоТАБАИД",       Истина);
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры
